app/controllers/heros_controller.rb

SELECT "heros".* FROM "heros" WHERE "heros"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        hero = Hero.find_by(id: params[:id])

INSERT INTO "heros" ("name", "super_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", nil], ["super_name", nil], ["created_at", "2023-03-28 07:40:53.613126"], ["updated_at", "2023-03-28 07:40:53.613126"]]
---
    def create
        hero = Hero.create!(hero_params)